#include "Initial.h"

double gnm[7][7] =
{{0, -29522, -2400.5,	  1334.5,	 909.8,	 -238,		69.7},
{0,	-1628.6,	3019.4,	 -2317.7,	 809.4,	 	356,		70.4},
{0,				0,	1652.9,		1243.2,	 183.1,	196.8,		75.8},
{0,				0,			 0,		 647.2,	-355.9,-141.4,	-142.7},
{0,				0,			 0,				 0,		87.4,-167.5,	 -23.4},
{0,				0,			 0,				 0,			 0,	-16.5,		13.1},
{0,				0,			 0,				 0,			 0,			0,	-81.2}};  /* 高斯系数*/
double hnm[7][7] =
{{0,		0,			  0,			0,			0,	  0,		 0},
{0,	4994.8,	-2688.1, -178.8,	289.4, 43.1, -21.8},
{0,			0,	 -572.7,	243.3, -218.6,	187,	47.1},
{0,			0,			  0, -532.5,	168.1, -115,	62.1},
{0,			0,			  0,			0, -304.7, -1.5,	 -65},
{0,			0,			  0,			0,			0, 99.6,	-0.8},
{0,			0,			  0,			0,			0,	  0,	53.9}};  /* 高斯系数*/

/*系统仿真参数*/
double H=0.05;    /*龙格库塔积分步长*/

/*卫星参数*/
double ACS_IBf[3][3]  ={{259.37, -0.46,  1.83},
{-0.46,263.58,  4.18},
{1.83,  4.18,65.46}};
/*{{  193.3, 0,0},
{ 0, 193.5, 0},
{0, 0, 48.08}};	/*卫星转动惯量*/
double ACS_Msat=450;   /*卫星质量*/
double ACS_MsatMin = 415;
/*平台陀螺*/
double ACS_Pgyrob1[3][3]={{1,0,0},{0,1,0},{0,0,1}};/*{{0,0,-1},{0,-1,0},{-1,0,0},{-0.57735,-0.57735,-0.57735}};/* 平台陀螺方向余弦矩阵 */
double ACS_GyroR1[3]={1.396e-4,1.396e-4,1.396e-4};/*平台陀螺噪声系数*/
double ACS_GyroRC1[3]={2.91e-5,2.91e-5,2.91e-5};/*平台陀螺常值漂移*/
unsigned char ACS_NoGyro1[3]={0,1,2};  /*平台陀螺测量有效标志*/

/* 光纤陀螺*/
double ACS_Pgyrob2[4][3]={{1,0,0},{0,1,0},{0,0,1},{0.57735,0.57735,0.57735}};/*{{0,0,-1},{0,-1,0},{-1,0,0},{-0.57735,-0.57735,-0.57735}};/* 光纤陀螺方向余弦矩阵 */
double ACS_GyroR2[4]={0.04e-4,0.04e-4,0.04e-4,0.04e-4};/*光纤陀螺噪声系数*/
double ACS_GyroRC2[4]={0.16e-5,0.16e-5,0.16e-5,0.16e-5};/*光纤陀螺常值漂移*/
unsigned char ACS_NoGyro2[3]={0,1,2};  /*光纤陀螺测量有效标志*/

/*星敏感器*/
double ACS_StarsbA[4] ={0.46193976625564, 0.33141357403559,0.80010314519127, 0.19134171618254};/* {0.50161239751720732,  0.30224446310001007,  0.78737374568608542,  0.19255095893474417};/* 星敏感器A到星体旋转四元数 */
double ACS_quatstarRA[3]={2.18e-5,2.18e-5,1.84e-4};/*星敏感器A噪声系数*/
double ACS_StarALimit[3]={20,30,20};/*星敏感器A光轴指向分别与太阳\地球\月球矢量夹角的临界值,度*/
double ACS_StarsbB[4] = {0.46193976625564,-0.33141357403559,0.80010314519127,-0.19134171618254};/*{0.50161239751720732,  -0.30224446310001007,  0.78737374568608542,  -0.19255095893474417};/* 星敏感器B到星体旋转四元数 */
double ACS_quatstarRB[3]={2.18e-5,2.18e-5,1.84e-4};/*星敏感器B噪声系数*/
double ACS_StarBLimit[3]={35,23,10};/*星敏感器B光轴指向分别与太阳\地球\月球矢量夹角的临界值,度*/

/*数字太阳敏感器*/
double ACS_PFsunb1[3][3]={{0,0,-1.0},{0.5,0.8660254,0},{0.8660254,-0.5,0}};/* 数字太阳敏感器1方向余弦矩阵 */
/*double ACS_PFsunb1[3][3]={{0,0,-1.0},{0.5,-0.8660254,0},{-0.8660254,-0.5,0}};*/
/*double ACS_PFsunb1[3][3]={{0,0,-1.0},{0.5,-0.8660254,0},{-0.8660254,-0.5,0}};*/
double ACS_S1[3]={1,0,0}; /*数字太阳敏感器1安装面*/
double ACS_Fsun1Limit=1.115265392;/*数字太阳敏感器1视场测量极值*/
double ACS_Fsun1R=0.0001;/*数字太阳敏感器1噪声系数*//*出于保护数字太阳模拟器的继电器考虑，此值设置较小*/
double ACS_PFsunb2[3][3]={{0.5,0.8660254,0},{0,0,1},{0.8660254,-0.5,0}};/* 数字太阳敏感器2方向余弦矩阵  */
/*double ACS_PFsunb2[3][3]={{-0.5,-0.8660254,0.0},{0.0,0.0,-1.0},{0.8660254,-0.5,0.0}};*//*{{0.5,0.8660254,0},{0,0,1},{0.8660254,-0.5,0}};/* 数字太阳敏感器2方向余弦矩阵  */
/*double ACS_PFsunb2[3][3]={{0.8660254,0.5,0.0},{0.5,-0.8660254,0.0},{0.0,0.0,-1.0}};*/
double ACS_S2[3]={1,0,0}; /*数字太阳敏感器2安装面*/
double ACS_Fsun2Limit=1.115265392;/*数字太阳敏感器2视场测量极值*/
double ACS_Fsun2R=0.0001;/*数字太阳敏感器2噪声系数*//*出于保护数字太阳模拟器的继电器考虑，此值设置较小*/

/*01太阳敏感器*/
double ACS_Psun01b[3][3]={{0,0.7071067811865,-0.7071067811865},{0,0.7071067811865,0.7071067811865},{1,0,0}};/* 0-1太阳敏感器方向余弦矩阵*/

/*加速度计*/
double ACS_Psb[3][3]={{1,0,0},{0,1,0},{0,0,1}};  /*加速度计安装矩阵*/
double ACS_AccelerR[3]={0.0001,0.0001,0.0001};/*加速度计噪声系数*/
double ACS_AccelerRC[3]={0.0001,0.0001,0.0001};/*加速度计常偏*/

/*磁强计*/
double ACS_PbBB[3][3]={{-1,0,0},{0,0,-1},{0,-1,0}};/* 磁强计方向余弦矩阵逆 */
double ACS_MagoutR[3]={0.0000001,0.0000001,0.0000001};/* 磁强计噪声系数 */

/*GPS接收机*/
double ACS_GPSR[14]={2.88675,2.88675,2.88675,0.01443376,0.01443376,0.01443376,17.32,17.32,17.32,0.3,0.3,0.3};/*GPS接收机噪声系数,x,y,z,vx,vy,vz,0,0,wgs84-x,wgs84-y,wgs84-z,wgs84-vx,wgs84-y,wgs84-z*/
unsigned char ACS_GPSSixFlag=0;/*GPS平均瞬时根数标志,1平均,0瞬时*/
int GPSweek = 0;
unsigned int GPSsecond = 0;
double ACS_GPSDelay = 0;

//测距雷达和测角相机
double Distance = 0;
double Theta_yx = 0, Theta_yz = 0;

/*气动力参数*/
double ACS_SaeroC=1;   /*迎风面积常数项*/
double ACS_SaeroS=4; /*迎风面积周期项*/
double ACS_Cd=2.0;  /*大气阻力系数*/
double ACS_Cp[3]={0.000,0.000,-0.1};  /*本体系下卫星质心到气动压心的矢径*/
double ACS_r0=6578000;   /*200km高度*/
double ACS_density0=0.36e-9;  /*在200km高度大气密度，kg/m3*/
double ACS_H0=37400;   /*密度标高  m*/
double ACS_miu0=0.1;   /*密度公式系数*/

/*磁参数*/
unsigned char ACS_Number_mag=6;  /*磁场阶数*/
double ACS_Mdis[3]={2,2,2};  /*卫星剩磁*/

/*太阳光压参数*/
double ACS_Psunb[3][3]={{0,1,0},{0,0,1},{1,0,0}};  /*太阳帆板安装矩阵*/
double ACS_niu=0.5;   /*太阳帆板表面反射系数*/
double ACS_Ssun=5;   /*太阳光照射面积*/
double ACS_Psun=9e-6;  /*太阳光压*/
double ACS_Cps[3]={0.0,0.0,-0.1};   /*太阳光压压心到卫星质心的矢径*/

/*推力器组参数*//*20091203推进系统初样设计报告*/
double ACS_DMsat[14]={25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0,25.0/2800.0};/*kg/s*//*推力器秒耗量*/
double ACS_KFthurst[14]={0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5};/*N/ms*//*推力器推力系数*/
double ACS_cosattis[14][3]={{0,0,-1},{0,0,-1},{0,0,-1},{0,0,-1},
{-1,0,0},{0,-1,0},{1,0,0},{0,1,0},
{-0.707,-0.707,0},{0.707,0.707,0},{-0.5,-0.5,-0.707},{0.5,0.5,-0.707},{0.5,0.5,-0.707},{-0.5,-0.5,-0.707}};/*推力器组喷嘴中心的方向余弦角*/
/*double ACS_Cattis[14][3]={{-0.203,-0.203,-1.354},{0.203,0.203,-1.354},{-0.203,0.203,-1.354},{0.203,-0.203,-1.354},
{-0.203,-0.203,-1.354},{-0.203,-0.203,-1.354},{0.203,0.203,-1.354},{0.203,0.203,-1.354},
{-0.203,-0.203,-1.354},{0.203,0.203,-1.354},{-0.203,0.203,-1.354},{-0.203,0.203,-1.354},
{0.203,-0.203,-1.354},{0.203,-0.203,-1.354}};*//*推力器组偏心矢量*/
double ACS_Cattis[14][3]={{0.203,-0.203,-1.354},{-0.203,0.203,-1.354},{-0.203,-0.203,-1.354},{0.203,0.203,-1.354},
{-0.203,-0.203,-1.354},{-0.203,-0.203,-1.354},{0.203,0.203,-1.354},{0.203,0.203,-1.354},
{-0.203,-0.203,-1.354},{0.203,0.203,-1.354},{0.203,-0.203,-1.354},{0.203,-0.203,-1.354},
{-0.203,0.203,-1.354},{-0.203,0.203,-1.354}};

/*飞轮模型参数*/
double ACS_Pwheelb[4][3]={{1,0,0},{0,1,0},{0,0,1},{1/1.732,1/1.732,1/1.732}};/*{{-1,0,0},{0,-1,0},{0,0,1},{0.57735,-0.57735,0.57735}};/* 飞轮安装矩阵 */
double ACS_Jwheel[4]={0.0063662,0.0063662,0.0063662,0.0063662};   /*飞轮转动惯量*/
double ACS_Twheel_MAX =1.05;/* N.m*/
/*调偏流机构参数*/
double ACS_Rsa[3][3]={{1,0,0},{0,1,0},{0,0,1}};/*调偏流机构耦合系数*/
double ACS_DWa[3]={0.00001,0.00001,0.00001};/*调偏流机构安装坐标系下偏流机构角加速度*/
double ACS_Pab[3][3]={{1,0,0},{0,1,0},{0,0,1}};  /*调偏流机构安装矩阵*/

/*磁力矩器*/
double ACS_PMagb [3][3] = {{1,0,0},{0,1,0},{0,0,1}};


/*double 内部定义*/
/*double Time,Wwheel[4],Y[6],Wib[3],Quatib[4],Msat,ThTime[14];*/
double nine[9];    /*轨道根数，nine[9]:A,E,SI,DW,SW,DM,SU,theta,n*/
double Worbity;    /*轨道坐标系下轨道角速度y方向分量*/
double Tb[3];   /*卫星合力矩*/
double Jingdu_GreenWitch_inertia;    /*格林尼制视恒星时角*/
double Bci[3];    /*卫星所处位置的地磁场矢量在惯性系下的分量形式*/
double Td_geomagnetic[3];    /*地磁干扰力矩*/
double Yousun;  /*太阳黄经*/
double Aisun;  /*黄赤交角*/
double SunInertia[3];  /*太阳矢量在惯性坐标系下的分量*/
double Quatis[4];   /*太阳坐标系相对惯性坐标系的姿态四元素*/
double QuatsiA[4],QuatsiB[4];  /*星敏感器A、B安装坐标系到惯性坐标系的姿态四元素*/
double QuatsiA0[4],QuatsiB0[4];/*星敏感器理论输出*/
double Tc[3];       /*三轴控制力矩*/
double Hbody[3];        /*卫星角动量*/
double TorqureCross[3]; /*卫星陀螺力矩*/
double Hwheel[3];       /*飞轮系统角动量*/
double Sqe[4];   /*偏差四元素*/
double Swe[3];   /*偏差角速度*/
double Wgyro1[4];  /*光纤陀螺1测量角速度*/
double Wgyro10[4];/*光纤陀螺1理论角速度*/
double Wgyro2[4];  /*光纤陀螺2测量角速度*/
double Wgyro20[4];/*光纤陀螺2理论角速度*/
double Fsun1out;   /*数字太阳敏感器1测量输出*/
double Fsun1out0; /*数字太阳敏感器1理论输出*/
unsigned char Fsun1Flag;/*数字太阳敏感器1测量有效标志位*/
double Fsun2out;   /*数字太阳敏感器2测量输出*/
double Fsun2out0; /*数字太阳敏感器2理论输出*/
unsigned char Fsun2Flag;/*数字太阳敏感器2测量有效标志位*/
unsigned char Sun01out[5];   /*0-1式太阳敏感器测量输出*/
double Td_gravity[3];   /*重力梯度力矩*/
double Uwheel[3]; /*飞轮电源*/
double F_aero[3];   /*气动力*/
double Td_aero[3];  /*气动力矩*/
double F_Sun[3];   /*太阳光压力*/
double Td_Sun[3];   /*太阳光压力矩*/
double MomentumWheel[4];  /*飞轮角动量*/
double as[3];   /*加速度计测量输出*/
double as0[3];   /*加速度计理论输出*/
double Twheel[3];   /*飞轮输出力矩*/
double MagU[3];   /*磁力矩器控制电压*/
double Tmag[3];   /*磁力矩器输出力矩*/
double Magout[3];  /*磁强计测量输出*/
double Magout0[3];/*磁强计理论输出*/
unsigned char Umag;  /*磁力矩器有效标志*/
double Earthi[3];  /*惯性系下地心矢量*/
double Mooni[3];  /*惯性系下月球矢量*/
double GPSout[14]; /*GPS测量输出*/
double GPSout0[14];/*GPS理论输出*/
double Fb[3]; /*本体系下卫星所受合外力*/
double F_Th[3];/*本体系下推力器合推力*/
double T_Th[3];/*本体系下推力器合力矩*/
unsigned char EshadowFlag;/*地影标志位*/
unsigned char StarAFlag;/*星敏感器A测量有效标志位*/
unsigned char StarBFlag;/*星敏感器B测量有效标志位*/
double Twheelb[3]; 	/*本体系下飞轮产生力矩*/


struct OUTPUTstr outputLAN;



/*double  外部定义*/
double Time= 425919600.0; /*卫星时间，一维，秒，0秒对应beijing 2013年07月01day,11hour*/
/*double Y[6]={6545298.2246124865,1154112.6737821733,0.00000000000000000,153.86531797261719,-872.61358048796740,7693.4020512707202};   */ /*卫星位置速度初始条件*/
double Y[6]={-311952.34786982,-6539193.514186,1146533.3970140,-961.76725344739,-1282.5297065351,-7576.5219871307};/*{6556988.00,1156174.00,0.00000000000000000,153.7281,-871.8354,-7686.541};*/
double Wib[3]={0.0001/180.0*ACD_PI,0.0001/180.0*ACD_PI,0.0001/180.0*ACD_PI};    /*本体坐标系相对惯性坐标系的姿态角速度在本体系下的分量形式,初始条件*/
double Quatib[4]={1.0,0,0,0};/*{0.098659,0.929311,0.095441,0.342839};*//*{0.098659,0.929311,0.095441,0.342839};  *//*本体坐标系相对惯性坐标系的姿态四元素，初始条件*/
double Wwheel[4]={0,0,0,0};       /*飞轮转速*/
double ThTime[14]={0,0,0,0,0,0,0,0,0,0,0,0,0,0};/*推力器开启时间*/
double Mags[3]={0,0,0};


double AOCS_Y[32];    /*系统输出数据*/
double AOCS_Y0[100];  /*系统理论输出数据*/
unsigned char AOCS_Flag[9];/*系统输出标志*/
unsigned char AOCS_Flag0[6];/*系统理论输出标志*/
/*unsigned int OUT[35];*/
double AOCS_Xupdata[19];/*系统输入变量*/
double AOCS_Xinitial[14];/*系统输入初始条件*/
double Msat; /*卫星质量*/
unsigned char sFlag=0;/*调偏流机构启动标志*/
int N;
double Euler[3];
double Quatio[4];

double para_WgyroX = (6e-4*ACD_PI/180.0);
double para_WgyroY = (6e-4*ACD_PI/180.0);
double para_WgyroZ = (6e-4*ACD_PI/180.0);
double para_WgyroS = (6e-4*ACD_PI/180.0);
double para_Kx = 6.25e-7*ACD_PI/180.0;
double para_Ky = 6.25e-7*ACD_PI/180.0;
double para_Kz = 6.25e-7*ACD_PI/180.0;
double para_Ks = 6.25e-7*ACD_PI/180.0;

long int cntN=0,cntN_A=0;


double Wheel_compute     =    0.1745329251994e+6;       /*飞轮角速度计算系数，pi/18*1e6 rad/s*/
unsigned char THRUST_OPEN= 1;
unsigned char THRUST_CLOSE =0;

unsigned char Thrust_Lv1Lv2 = 1;     /*发动机自锁阀LV1/LV2*/
unsigned char Thrust_Lv3Lv4 = 1;     /*发动机自锁阀LV3/LV4*/
unsigned char Thrust_Lv1=0,Thrust_Lv2=0,Thrust_Lv3=0,Thrust_Lv4=0;

